move plantuml to mermaid -- WIP
