--- a/src/courses/archi/cours-hexagonal.md
+++ b/src/courses/archi/cours-hexagonal.md
@@ -19,33 +19,28 @@ tags:
 
 ---
 
-```plantuml
-@startuml
+```mermaid
+graph TD
+  subgraph my_app
+    View
+    Controller
+    Model[(Model)]
+  end
 
-folder my_app {
-  component View
-  component Controller
-  database Model
-  
   View --> Controller
   Controller --> Model
-}
-
-@enduml
 ```
 
 _Quel est le **but** de cette application ?_ 🤔
 
