--- a/src/courses/k8s/cours-k8s-main.md
+++ b/src/courses/k8s/cours-k8s-main.md
@@ -459,16 +459,15 @@ tags:
 
 ---
 
-```plantuml
-@startuml
+```mermaid
+---
 title: "Boucle de réconciliation"
-rectangle "Observation" as observe
-rectangle "Action" as act
-rectangle "Diff" as diff
-observe --> diff
-diff --> act
-act --> observe
-@enduml
+---
+flowchart TD
+    Observation --> Diff
+    Diff --> Action
+    Action --> Observation
+
 ```
 
 ---
